# 3 Poznański Bieg Niepodległości

In 3 Poznański Bieg Niepodległości took part 22542 participants. 
I decided to analyse this race and answer a few basic questions. 
<br> Web scraping using synchronous requests, in this case, was slow and inefficient. 
<br> After research, I decided to use asynchronous web-scraping with asyncio module. <br> Surprisingly this way of solving problem boosted my web-scraper and decreased waiting time from about 10/9 minutes to 3/2 minutes. 

Analysis's questions:

> Is there any correlation beetwen

> What is the average finish time (in minutes) for the participants?

> Did the participants finish times follow a normal distribution? 

> What are differences between males and females results along various age groups?


We can split this analysis into 4 main parts:

* 1. Data extraction / web scraping
* 2. Data cleaning
* 3. Memory usage optimization
* 4. Data analysis and visualisation

In [3]:
# Importing Python's modules.
import re
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

from urllib.request import urlopen
from bs4 import BeautifulSoup
import requests
import time

In [4]:
#URL with runners results during 3 Poznański Bieg Niepodległości.
URL = 'https://enduhub.com/pl/wyniki/2018/11/11/bieganie/3-poznanski-bieg-niepodleglosci,46448/'

## Web-Scraping with asyncio module

We are going to get results from each page using Python's web-scraper.
Requaierd modules:

* Asyncio is the asynchronous IO library that was introduced in python 3.4. Asyncio uses event loops, coroutines, and tasks to minimize idle time. <br> It's quite complex, for more informations check:

 > https://asyncio.readthedocs.io/en/latest/
 
 >https://medium.com/@santhoshhari/efficient-web-scraping-with-pythons-asynchronous-programming-6b9e730f1ff7

* Aiohttp creates HTTP client/server sessions for asyncio.

In [11]:
# Importing asyncio's modules.
import nest_asyncio
nest_asyncio.apply()
import asyncio
import aiohttp


async def fetch_url(session, url):
    ''' This function fetches URL from the website that you want to scrape. '''
    async with session.get(url, timeout=60*60) as response:
        return await response.text()

async def fetch_all_urls(session, urls, loop):
    ''' This function fetches all URLs from the website that you want to scrape. '''
    results = await asyncio.gather(*[fetch_url(session, url) for url in urls],
    return_exceptions=True)
    
    return results

def get_htmls(urls):
    ''' This function takes in a list of URLs, returns a list with URLs as keys
    and the HTML response returned by the web server as values.
    
    TCPConnector - to tweak or change transport layer of requests you can 
    pass a custom connector to ClientSession and family.
    '''
    if len(urls) > 1:
        loop = asyncio.get_event_loop()
        connector = aiohttp.TCPConnector(limit=10)
        async with aiohttp.ClientSession(loop=loop, connector=connector) as session:
            htmls = loop.run_until_complete(fetch_all_urls(session, urls, loop))
            raw_result = list(htmls)
    else:
        headers = {'User-Agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11_5) AppleWebKit/537.36(KHTML, like Gecko) Chrome/50.0.2661.102 Safari/537.36'}
        raw_result = requests.get(urls[0], headers=headers).text

    return raw_result

def make_page_links(base_url):
    '''  This definition of function iterates over range of pages
    on website (in this case 266 pages) and returns list of all URLs. 
    '''
    pages = [base_url + '?page={}'.format(str(i)) for i in range(1,227)]
    
    return pages

## Making DataFrame

My first idea was to do web-scraping using request and bs4 modules. Iteration over 226 pages took about 8-10 minutes.
<br> It was too long, so I decided to read about some optimization. I found really interesting article about an asynchronous
package called asyncio. 
<br> Using asynchronous web-scraping with asyncio module I saved up to 6 minutes (70 % of waiting time) durign scraping data from web.

In [12]:
%%time
url_list = make_page_links(URL)
raw_result = get_htmls(url_list)

CPU times: user 814 ms, sys: 113 ms, total: 927 ms
Wall time: 2min 31s

In [13]:
# Checking if we scraped all 226 pages.
len(raw_result)

226

We have our raw data. Now we need to extract from HTML parts like tables('tr', {'class' : 'row1 Zawody'}) and rows ('td').
<br> Then we need to convert a result into pandas DataFrame to prepare it for data wrangling and cleaning.
<br> In next step we will extract collumn names from first page on 'https://enduhub.com/pl/wyniki/2018/11/11/bieganie/3-poznanski-bieg-niepodleglosci,46448/'. <br> Finally we have to concat both objects and voilà our DataFrame is ready.

In [14]:
def make_table():
    ''' This function returns DataFrame that contains all 
    results (rows) from 3 Poznański Bieg Niepodległości. 
    Let's get ready to wrangle this Frame! 
    '''   
    list_rows = []
    for result in raw_result:
        content = BeautifulSoup(result, 'lxml').find_all('tr', {'class' : re.compile('row.*? Zawody')})
        for row in content:
            cells = row.find_all('td')
            str_cells = str(cells) 
            clean_cells = re.compile('<.*?>') 
            raw_rows = re.sub(clean_cells, '',str_cells)
            list_rows.append(raw_rows)
            
    return pd.DataFrame(list_rows)

## If you don't want to use regex, you can try this:
## clean_cells = BeautifulSoup(str_cells, 'html.parser').get_text()

In [15]:
df1 = make_table()
df1.head(3)

                                                   0
0  [#1, \n, 1, 25000, Artur Kozłowski, Sieradz, P...
1  [#2, \n, 2, 24999, Tomasz Szymkowiak, Września...
2  [#3, \n, 3, 1858, Dawid Garski, Dąbie, POL, ML...

## Data Cleaning

Fun part. It is important to be able to deal with messy data, whether that means missing values, inconsistent formatting, <br> malformed records, or nonsensical outliers. The web-scraping result, in this case, HTML is always full of tricky commas and characters. <br> It is the best practice resource for learning data wrangling. In the beginning, we need to create DataFrame with separate columns.  <br> To do this we'll use expand argument inside the split function.

In [16]:
df_ooo = df1[0].str.replace(', ', ',')

In [17]:
df_ooo = pd.DataFrame(df_ooo)

In [18]:
df_ooo = df_ooo[:][0].str.split(',', expand=True)

After an investigation, I found tricky comma that broke table structure. Some of the runners included a few Klub names during registration, I assume. 
<br> I created function that counts commas in single row compare it with proper value (16). 
<br>  If the value is equal to 17 or 18 function splits row, gets first Klub name and creates a row with 16 commas.

In [19]:
df_ooo.head(3)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18
0,[#1,\n,1,25000,Artur Kozłowski,Sieradz,POL,Sanprobi Team,1985,M30,1,1,-,00:15:47,00:31:02,00:31:01],None,None,None
1,[#2,\n,2,24999,Tomasz Szymkowiak,Września,POL,Krispol Active Team Września,1983,M30,2,2,-,00:15:47,00:31:22,00:31:21],None,None,None
2,[#3,\n,3,1858,Dawid Garski,Dąbie,POL,MLKS Baszta Bytów,1995,M20,1,3,-,00:16:21,00:32:33,00:32:32],None,None,None

In [21]:
df_ooo[8].value_counts().tail()

MARATON LESZNO                 1
bieg o kulach                  1
Akademia Marynarki Wojennej    1
WIDOCZNIE LEPSI                1
                               1
Name: 8, dtype: int64

In [22]:
print(len(df1))

22542

In [23]:
def tricky_comma(row):
    ''' This function splits row if there are more than 16 comas
    and creates right value.
    '''
    if row.count(',') == 16:
        return row.split(',')[:7][:] + row.split(',')[8:][:]
    elif row.count(',') == 17:
        return row.split(',')[:7][:] + row.split(',')[9:][:]
    elif row.count(',') == 18:
        return row.split(',')[:7][:] + row.split(',')[10:][:]
    else:
        return row

In [24]:
df2 = df1[0].apply(tricky_comma)

In [25]:
df2 = pd.DataFrame(df2)

In [26]:
df3 = df2[0].str.replace(', ', ',')

In [27]:
df4 = pd.DataFrame(df3)[0].str.split(',' , expand=True)

In [28]:
df4.head(3)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,[#1,\n,1,25000,Artur Kozłowski,Sieradz,POL,Sanprobi Team,1985,M30,1,1,-,00:15:47,00:31:02,00:31:01]
1,[#2,\n,2,24999,Tomasz Szymkowiak,Września,POL,Krispol Active Team Września,1983,M30,2,2,-,00:15:47,00:31:22,00:31:21]
2,[#3,\n,3,1858,Dawid Garski,Dąbie,POL,MLKS Baszta Bytów,1995,M20,1,3,-,00:16:21,00:32:33,00:32:32]

Cleaning proces includes:

* Dropping unnecessary characters like '[]#'
* Creating columns names
* Renaming columns
* Dropping unnecessary columns in a DataFrame
* Reseting the table's index
* Using capitalize() function on columns

In [29]:
df4[0] = df4[0].str.strip('[]#')
df4[15] = df4[15].str.strip('[]')

In [30]:
df4.head(3)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,1,\n,1,25000,Artur Kozłowski,Sieradz,POL,Sanprobi Team,1985,M30,1,1,-,00:15:47,00:31:02,00:31:01
1,2,\n,2,24999,Tomasz Szymkowiak,Września,POL,Krispol Active Team Września,1983,M30,2,2,-,00:15:47,00:31:22,00:31:21
2,3,\n,3,1858,Dawid Garski,Dąbie,POL,MLKS Baszta Bytów,1995,M20,1,3,-,00:16:21,00:32:33,00:32:32

In [36]:
def get_page(URL):
    '''  This function gets 1 argument and return
    BeautifulSoup object containing content of the page.    
    url - This is the url of website that you want to scrape.
    '''
    try:
        req = urlopen(URL)
    except requests.exceptions.RequestException:
        return None
    
    return BeautifulSoup(req.read(), 'lxml')

def get_col(URL):
    ''' This function gets 1 argument and return
    DataFrame containing raw headers of the socre table.    
    url - This is the url of website that you want to scrape.
    '''
    clean_headers = []
    page = get_page(URL)
    column_names = page.find_all('th')
    col_str = str(column_names)
    clean_headers.append(BeautifulSoup(col_str, 'lxml').get_text())
    
    return pd.DataFrame(clean_headers)

In [37]:
columns = get_col(URL)
columns

                                                   0
0  [\n\n\n\n, \n\n\n\n\n\n\n\n\n\n, \n\n\n\n\nMsc...

In [38]:
columns = columns[0].str.split(',', expand=True)
columns.iloc[0] = columns.iloc[0].str.replace('\n','').str.replace(' ','')

In [39]:
frames = [columns, df3]

In [40]:
df_table = pd.concat(frames, ignore_index=True)

In [41]:
df_table.head(3)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,[,,Msc,Nr,ImięNazwisko,Miejscowość,Kraj,Klub,Rok,Kat,MiejsceWKat,M,K,5Km,Wynik,Netto]
1,"[#1,\n,1,25000,Artur Kozłowski,Sieradz,POL,San...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"[#2,\n,2,24999,Tomasz Szymkowiak,Września,POL,...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [42]:
df_table2 = df_table.rename(columns=df.iloc[0])

NameError: name 'df' is not defined

In [309]:
df_table2.head(3)

,[,,Msc,Nr,ImięNazwisko,Miejscowość,Kraj,Klub,Rok,Kat,MiejsceWKat,M,K,5Km,Wynik,Netto]
0,[,,Msc,Nr,ImięNazwisko,Miejscowość,Kraj,Klub,Rok,Kat,MiejsceWKat,M,K,5Km,Wynik,Netto]
1,1,\n,1,25000,Artur Kozłowski,Sieradz,POL,Sanprobi Team,1985,M30,1,1,-,00:15:47,00:31:02,00:31:01
2,2,\n,2,24999,Tomasz Szymkowiak,Września,POL,Krispol Active Team Września,1983,M30,2,2,-,00:15:47,00:31:22,00:31:21

In [310]:
proper_columns = {'[': 'Index', 'Msc': 'Place', 'Nr': 'Number', 'Kraj': 'Country'
                  'ImięNazwisko':'Runner_name', 'Kat':'Category', 'Klub' : 'Club',
                  'Rok' : 'Year', 'MiejsceWKat': 'Place_in_cat', 'Wynik' : 'Score_time',
                  'Netto]': 'Netto'}

df_table2.rename(columns=proper_columns, inplace=True)

In [349]:
df_table2.head(3)

,Index,,Miejsce,Numer,Imię_Nazwisko,Miejscowość,Kraj,Klub,Rok,Kategoria,Miejsce_w_Kat,M,K,5Km,Wynik,Netto
0,[,,Msc,Nr,ImięNazwisko,Miejscowość,Kraj,Klub,Rok,Kat,MiejsceWKat,M,K,5Km,Wynik,Netto]
1,1,\n,1,25000,Artur Kozłowski,Sieradz,POL,Sanprobi Team,1985,M30,1,1,-,00:15:47,00:31:02,00:31:01
2,2,\n,2,24999,Tomasz Szymkowiak,Września,POL,Krispol Active Team Września,1983,M30,2,2,-,00:15:47,00:31:22,00:31:21

In [548]:
df_table3 = df_table2.drop(columns=['Index',''])

In [549]:
df_table3.drop(df_table3.index[0], inplace=True)

In [577]:
df_table3.head(3)

,Miejsce,Numer,Imię_Nazwisko,Miejscowość,Kraj,Klub,Rok,Kategoria,Miejsce_w_Kat,M,K,5Km,Wynik,Netto
1,1,25000,Artur Kozłowski,Sieradz,POL,Sanprobi Team,1985,M30,1,1,0,00:15:47,00:31:02,00:31:01
2,2,24999,Tomasz Szymkowiak,Września,POL,Krispol Active Team Września,1983,M30,2,1,0,00:15:47,00:31:22,00:31:21
3,3,1858,Dawid Garski,Dąbie,POL,MLKS Baszta Bytów,1995,M20,1,1,0,00:16:21,00:32:33,00:32:32

In [726]:
df_table3['Kategoria'].value_counts()

 M30     5672
 M40     4116
 M20     3499
 K30     2746
 K20     1956
 K40     1943
 M50     1169
 M16      406
 K50      346
 M60      340
 K16      141
 K60       69
 M70+      50
 K70+       3
Name: Kategoria, dtype: int64

In [551]:
df_table3['Miejscowość'] = df_table3['Miejscowość'].astype(str)

In [552]:
df_table3.loc[:,('Miejscowość')] = df_table3.loc[:,('Miejscowość')].apply(lambda x: x.title())

In [553]:
df_table3['M'] = df_table3['M'].apply(lambda x: 0 if x == ' -' else 1)

In [554]:
df_table3['K'] = df_table3['M'].apply(lambda x: 1 if x == ' -' else 0)

In [563]:
df_table3.head(7)

,Miejsce,Numer,Imię_Nazwisko,Miejscowość,Kraj,Klub,Rok,Kategoria,Miejsce_w_Kat,M,K,5Km,Wynik,Netto
1,1,25000,Artur Kozłowski,Sieradz,POL,Sanprobi Team,1985,M30,1,1,0,00:15:47,00:31:02,00:31:01
2,2,24999,Tomasz Szymkowiak,Września,POL,Krispol Active Team Września,1983,M30,2,1,0,00:15:47,00:31:22,00:31:21
3,3,1858,Dawid Garski,Dąbie,POL,MLKS Baszta Bytów,1995,M20,1,1,0,00:16:21,00:32:33,00:32:32
4,4,22947,Adrian Bednarek,Bydgoszcz,POL,—,1990,M20,2,1,0,00:16:37,00:32:38,00:32:37
5,5,23974,Krzysztof Jilek,Bystrzyca Kłodzka,POL,Ulks Bystrzyca Kłodzka/FIZJOTERAPEUTY/Biegi Ś...,1997,M20,3,1,0,00:16:38,00:32:55,00:32:54
6,6,17330,Paweł Młodzikowski,Adamów,POL,Kb V-MAX Adamów,1987,M30,3,1,0,00:16:41,00:33:34,00:33:33
7,7,18319,Paweł Raczyński,Krosno Odrzańskie,POL,5 kresowy batalion saperów Krosno Odrzańskie,1990,M20,4,1,0,00:16:41,00:33:37,00:33:36

## Memory usage optimalization

I wrote a loop to iterate over each object column, check if the number of unique values is less than 50%, and if so, convert it to the category type.
<br> We've gone from 18.3 MB of memory usage to 7.4 MB of memory usage, or a 60% reduction!

In [697]:
df_table3 = df_table3.dropna()
df_table3.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22456 entries, 1 to 22542
Data columns (total 14 columns):
Miejsce          22456 non-null object
Numer            22456 non-null object
Imię_Nazwisko    22456 non-null object
Miejscowość      22456 non-null object
Kraj             22456 non-null object
Klub             22456 non-null object
Rok              22456 non-null object
Kategoria        22456 non-null object
Miejsce_w_Kat    22456 non-null object
M                22456 non-null int64
K                22456 non-null int64
5Km              22456 non-null object
Wynik            22456 non-null object
Netto            22456 non-null object
dtypes: int64(2), object(12)
memory usage: 18.4 MB

I needed to convert the list back into a dataframe and make a new column ("Runner_mins") for runner chip times expressed in just minutes.

In [704]:
mins = df_table3['Wynik'].dropna().tolist()

time_mins = []
for i in test:
    h, m, s = i.split(':')
    math = (int(h) * 3600 + int(m) * 60 + int(s))/60
    time_mins.append(math)

df_table3['Runner_mins'] = time_mins

In [705]:
df_table3.head(3)

,Miejsce,Numer,Imię_Nazwisko,Miejscowość,Kraj,Klub,Rok,Kategoria,Miejsce_w_Kat,M,K,5Km,Wynik,Netto,Runner_mins
1,1,25000,Artur Kozłowski,Sieradz,POL,Sanprobi Team,1985,M30,1,1,0,00:15:47,00:31:02,00:31:01,31.033333
2,2,24999,Tomasz Szymkowiak,Września,POL,Krispol Active Team Września,1983,M30,2,1,0,00:15:47,00:31:22,00:31:21,31.366667
3,3,1858,Dawid Garski,Dąbie,POL,MLKS Baszta Bytów,1995,M20,1,1,0,00:16:21,00:32:33,00:32:32,32.550000

In [706]:
converted_obj = pd.DataFrame()

for col in df_table3.columns:
    num_unique_values = len(df_table3[col].unique())
    num_total_values = len(df_table3[col])
    if num_unique_values / num_total_values < 0.5:
        converted_obj.loc[:,col] = df_table3[col].astype('category')
    else:
        converted_obj.loc[:,col] = df_table3[col]

In [707]:
converted_obj.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22456 entries, 1 to 22542
Data columns (total 15 columns):
Miejsce          22456 non-null object
Numer            22456 non-null object
Imię_Nazwisko    22456 non-null object
Miejscowość      22456 non-null category
Kraj             22456 non-null category
Klub             22456 non-null category
Rok              22456 non-null category
Kategoria        22456 non-null category
Miejsce_w_Kat    22456 non-null category
M                22456 non-null category
K                22456 non-null category
5Km              22456 non-null category
Wynik            22456 non-null category
Netto            22456 non-null category
Runner_mins      22456 non-null category
dtypes: category(12), object(3)
memory usage: 7.9 MB

In [708]:
start_mem_usg = df_table3.memory_usage(deep=True).sum() / 1024**2
mem_usg = converted_obj.memory_usage(deep=True).sum() / 1024**2

In [709]:
print("This is ",100* round(mem_usg/start_mem_usg,4) ,"% of the initial size.")

This is  41.74 % of the initial size.

# Data Analysis and Visualization

In [2]:
df_table3['Runner_mins'].describe(include=[np.number]).to_frame()

NameError: name 'df_table3' is not defined

The average running time for all runners was ~85 mins. <br> The fastest runner finished 5km in 36 mins, and the slowest runner finished race in 148 minutes.

In [1]:
from pylab import rcParams
rcParams['figure.figsize'] = 15, 5
x = df_table3['Runner_mins']
ax = sns.distplot(x, hist=True, kde=True, rug=False, color='b', bins=35, hist_kws={'edgecolor':'black'})

plt.show()

NameError: name 'df_table3' is not defined

As we can see the distribution looks almost normal.